---
type: DocumentSaveToLocalProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# DocumentSaveToLocalProgressChangedEventArgs

`Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | BeforeSaveToCentral | 2017 Subscription Update | `public bool BeforeSaveToCentral { get ; }` |
| Property | FinishedStreams | 2017 Subscription Update | `public int FinishedStreams { get ; }` |
| Property | SaveToLocalFinished | 2017 Subscription Update | `public bool SaveToLocalFinished { get ; }` |
| Property | TotalStreams | 2017 Subscription Update | `public int TotalStreams { get ; }` |